[
  {
    "stageID": 0,
    "stageDescription": "Ты стоишь перед первым перекрестком. Влево ведет темный коридор, усеянный странными символами. Вправо открывается дверь с таинственным светом, который привлекает твое внимание. Куда направишь свои шаги?",
    "stepChoices": [
      {
        "id": 1,
        "text": "Идти влево по темному коридору"
      },
      {
        "id": 2,
        "text": "Открыть дверь и войти в светлую комнату."
      },
      {
        "id": 3,
        "text": "Осмотреться в поисках чего-то интересного."
      }
    ],
    "stageImg": "/image/stage0.jpg"
  },
  {
    "stageID": 1,
    "stageDescription": "Ты выбираешься вглубь темного коридора, где тени таинственно плетутся по стенам. С каждым шагом твой факел освещает странные символы, выгравированные на стенах. Внезапно ты слышишь тихий шепот, и впереди замирает темная фигура. Это существо в плаще с обрамленным капюшоном стоит перед тобой.",
    "stepChoices": [
      {
        "id": 11,
        "text": "Спросить существо, кто оно и что делает здесь."
      },
      {
        "id": 12,
        "text": "Попытаться обойти существо и пройти дальше."
      },
      {
        "id": 13,
        "text": "Атаковать существо."
      }
    ],
    "stageImg": "/image/stage1.jpg"
  },
  {
    "stageID": 2,
    "stageDescription": "Ты решаешь войти в комнату, из которой исходит таинственный свет. За дверью раскрывается прекрасная зала, украшенная арками и драгоценностями. На центре стоит стол, покрытый картами и свитками.",
    "stepChoices": [
      {
        "id": 21,
        "text": "Исследовать карты и свитки на столе."
      },
      {
        "id": 22,
        "text": "Обследовать украшения в поисках ценных предметов"
      },
      {
        "id": 23,
        "text": "Подойти к двери на другом конце комнаты и открыть ее."
      }
    ],
    "stageImg": "/image/stage2.jpg"
  },
  {
    "stageID": 3,
    "stageDescription": "Ты оглядываешься по сторонам, стараясь заметить что-то необычное. Вдалеке замечаешь подозрительно выглядящую статую, а рядом с ней маленький ларец.",
    "stepChoices": [
      {
        "id": 31,
        "text": "Подойти к статуе и рассмотреть ее внимательно."
      },
      {
        "id": 32,
        "text": "Открыть ларец, чтобы узнать, что внутри."
      },
      {
        "id": 33,
        "text": "Продолжить осмотр искомого, игнорируя статую и ларец."
      }
    ],
    "stageImg": "/image/stage3.jpg"
  },

  {
    "stageID": 11,
    "stageDescription": "Существо поднимает свой капюшон, раскрывая лицо с темными глазами. Оказывается, это стражник, запертый здесь для защиты от темных сил. Он предостерегает тебя остаться настороже и предостерегает о том, что в этом лабиринте скрываются многие опасности.",
    "stepChoices": [
      {
        "id": 111,
        "text": "Попросить стражника провести тебя дальше."
      },
      {
        "id": 112,
        "text": "Расспросить стражника о тайнах лабиринта и сил, что в нем обитают"
      }
    ],
    "stageImg": "/image/stage11.jpg"
  },

  {
    "stageID": 12,
    "stageDescription": "Ты делаешь попытку пройти мимо стражника, но он встает на твой путь, блокируя проход. Он предупреждает, что дальнейший проход требует разрешения",
    "stepChoices": [
      {
        "id": 121,
        "text": "Попытаться уговорить стражника пропустить тебя."
      },
      {
        "id": 122,
        "text": "Попытаться обойти стражника силой."
      }
    ],
    "stageImg": "/image/stage12.jpg"
  },

  {
    "stageID": 13,
    "stageDescription": "Ты нападаешь на стражника, но он оказывается более опытным бойцом. Быстро отпарив твои удары, он в ответ противостоит атакой.",
    "stepChoices": [
      {
        "id": 131,
        "text": "Продолжить бой с использованием магии или оружия."
      },
      {
        "id": 132,
        "text": "Попытаться уйти от сражения и идти в другую сторону."
      }
    ],
    "stageImg": "/image/stage13.jpg",
    "isDeadPoint": true
  }
]